// 1) დაამატეთ სორტირების კიდევ ერთი საშუალება დროის მიხედვით დალაგება ზრდადობით ან კლებადობით

// 2) დამატეთ ერთი როუტე რომელსაც გადაეცემა პარამეტრი ID და დააბრუნეთ ერთი კონკრეტული პარამეტრი, 
// თუ პარტამეტრით ვერ მოიძებნა ტური დააბრუნეთ 404 სტატუსის კოდი და ერორის ობიექტი, 
// რომელშიც გექნებათ 2 კუთვნილება status და message

// 3) შექმენით ფოლდერი სახელად routers რომელშიც შექმნით ფაილს სახელად tours.router.js, 
// შექმენით როუტერ ობიექტი და დაარეჰისტრირეთ ყვეკა ის მეთოდი რომელიც app ფაილში გქონდათ, 
// დააქსპორტეთ როუტერი და use მეთოდის გამოყენებით დაარეგისტირრეთ მთავარ ფაილში

// External modules
const express = require("express");

// Router imports
const toursRouter = require("./routers/tours.router.js");

const app = express();

app.use("/tours", toursRouter);

app.listen(3000, () => {
    console.log("Server listens...");
})