// 2) გამოიყანეთ buffer მოდული იმსათვის რ0ომ შექმნატ ხელოვნურად რაღაცა მეხსიერება 10 ადგილით და შეავსეთ ეგ მასივი სიმბოლოებით, 
// შემდეგ კი გამოიყენეთ toString მეთოდი რომ რეალურ სტრინგად გარდაქმნათ, აგრეთვე გამოიყენეთ buffer მოდულის from მეთოდი იმსიასათვის,
//  რომ გაიგო კონკრეტულ სტრინგიში ყველა სიმბიოლოს კოდი (კომენტარებით ახსენით რა არის buffer და რა არიოს ორობითი  binaryმონაცემი)

const string1 = Buffer.alloc(10, "a");

console.log(string1);
console.log(string1.toString());

const stringToBuffer = Buffer.from("Hello World");

console.log(stringToBuffer);

// Buffer არის Node.js-ის მოდული, რომელიც საშუალებას გვაძლევს ვიმუშაოთ ორობით მონაცემებთან და ხელოვნურად გამოვყოთ მათთვის მეხსიერება.
// ორობითი მონაცემი არის ისეთი მონაცემი, რომელიც წარმოდგენილია ბაიტების(byte-ების) სახით, ანუ ნულებისა და ერთების (bit-ების) კომბინაციით.
// ერთი ბაიტი შედგება 8 ბიტისგან.