// 5) buffer.from მეთოდს გადაეცით ascii - ის ცხრილიდან რიცხვები, 
// თქვენი დავალებაა რომ console - ში გამოიტანოთ ეს რიცხვები როგორც string - ი, გამოიყენეთ toString() მეთოდი

const myBuffer = Buffer.from([70, 117, 108, 108, 45, 115, 116, 97, 99, 107, 32, 100, 101, 118, 101, 108, 111, 112, 101, 114]);

console.log(myBuffer.toString());

// 6) buffer - ით შექმენით 5 ადგილიანი მეხსიერება, მეორე არგუმენტად კი გადეცით 
// ascii - ის ცხრილიდან რომელიმე რიცხვი და დაბეჭდეთ საბოლოო შედეგი

const string1 = Buffer.alloc(5, 97);

console.log(string1);